benchmark_results/courses_4t_200c_20260118_095756.txt
Running 30s test @ http://127.0.0.1:8000/dev/benchmark-api?mode=courses
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   547.55ms   91.49ms 878.03ms   82.21%
    Req/Sec    91.35     35.60   210.00     67.17%
  Latency Distribution
     50%  513.18ms
     75%  588.54ms
     90%  683.35ms
     99%  837.77ms
  10893 requests in 30.08s, 80.51MB read
  Non-2xx or 3xx responses: 10893
Requests/sec:    362.13
Transfer/sec:      2.68MB