benchmark_results/dashboard_4t_200c_20260118_091920.txt
Running 30s test @ http://127.0.0.1:8000/dev/benchmark-api?mode=dashboard
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   488.03ms   34.70ms 588.96ms   86.17%
    Req/Sec   101.94     21.03   170.00     65.80%
  Latency Distribution
     50%  487.72ms
     75%  502.65ms
     90%  520.04ms
     99%  565.12ms
  12197 requests in 30.07s, 13.24MB read
Requests/sec:    405.59
Transfer/sec:    450.75KB