benchmark_results/dashboard_4t_200c_20260118_095756.txt
Running 30s test @ http://127.0.0.1:8000/dev/benchmark-api?mode=dashboard
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   546.15ms   99.12ms   1.04s    88.00%
    Req/Sec    91.92     44.66   230.00     67.49%
  Latency Distribution
     50%  525.42ms
     75%  563.43ms
     90%  641.22ms
     99%  948.52ms
  10909 requests in 30.08s, 11.84MB read
Requests/sec:    362.63
Transfer/sec:    403.00KB