benchmark_results/db_2t_50c_20260118_090633.txt
Running 10s test @ http://127.0.0.1:8000/dev/benchmark-api?mode=db
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   132.49ms   78.11ms 683.98ms   91.62%
    Req/Sec   212.49     55.62   320.00     76.60%
  Latency Distribution
     50%  110.89ms
     75%  126.57ms
     90%  173.39ms
     99%  560.79ms
  4039 requests in 10.07s, 4.36MB read
Requests/sec:    401.16
Transfer/sec:    443.07KB