benchmark_results/db_2t_50c_20260118_091920.txt
Running 10s test @ http://127.0.0.1:8000/dev/benchmark-api?mode=db
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   118.94ms   76.77ms 674.08ms   95.51%
    Req/Sec   240.54     38.87   343.00     77.89%
  Latency Distribution
     50%  103.34ms
     75%  111.77ms
     90%  120.85ms
     99%  572.97ms
  4579 requests in 10.03s, 4.94MB read
Requests/sec:    456.40
Transfer/sec:    504.09KB