benchmark_results/db_4t_200c_20260118_091920.txt
Running 30s test @ http://127.0.0.1:8000/dev/benchmark-api?mode=db
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   419.16ms   30.56ms 501.22ms   85.95%
    Req/Sec   119.45     62.14   292.00     65.70%
  Latency Distribution
     50%  418.73ms
     75%  433.01ms
     90%  449.06ms
     99%  484.22ms
  14227 requests in 30.05s, 15.35MB read
Requests/sec:    473.37
Transfer/sec:    522.84KB