benchmark_results/enrollment_8t_500c_20260118_091357.txt
Running 30s test @ http://127.0.0.1:8000/dev/benchmark-api?mode=enrollment
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   669.59ms  141.71ms   1.25s    84.59%
    Req/Sec    50.94     39.29   220.00     74.89%
  Latency Distribution
     50%  611.69ms
     75%  710.77ms
     90%  893.87ms
     99%    1.18s 
  10011 requests in 27.89s, 10.87MB read
  Socket errors: connect 251, read 0, write 0, timeout 0
Requests/sec:    358.98
Transfer/sec:    399.30KB