benchmark_results/enrollment_8t_500c_20260118_091920.txt
Running 30s test @ http://127.0.0.1:8000/dev/benchmark-api?mode=enrollment
  8 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   581.23ms   40.08ms 899.56ms   76.32%
    Req/Sec    53.23     27.95   190.00     76.28%
  Latency Distribution
     50%  574.71ms
     75%  596.10ms
     90%  632.29ms
     99%  694.34ms
  12536 requests in 30.09s, 13.62MB read
  Socket errors: connect 251, read 0, write 0, timeout 0
Requests/sec:    416.58
Transfer/sec:    463.36KB