benchmark_results/simple_2t_50c_20260118_091357.txt
Running 10s test @ http://127.0.0.1:8000/dev/benchmark-api?mode=simple
  2 threads and 50 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.00us    0.00us   0.00us     nan%
    Req/Sec     0.00      0.00     0.00       nan%
  Latency Distribution
     50%    0.00us
     75%    0.00us
     90%    0.00us
     99%    0.00us
  0 requests in 103.23ms, 0.00B read
Requests/sec:      0.00
Transfer/sec:       0.00B